/*=============================================================================

		ヘルプ[ Help.h ]

-------------------------------------------------------------------------------
	■　製作者
		大野拓也

	■　作成日
		2016/11/16
-------------------------------------------------------------------------------*/

#ifndef _HELP_H_
#define _HELP_H_

#define MAX_HELP ( 30 )

/*-----------------------------------------------------------------------------
	プロトタイプ宣言
-----------------------------------------------------------------------------*/
void InitHelp( void );		//	ヘルプの初期化
void UninitHelp( void );	//	ヘルプの終了
void UpdateHelp( void );	//	ヘルプの更新
void DrawHelp( void );		//	ヘルプの描画

void SetHelp( D3DXVECTOR3 Pos );
void SetOff( int Index );

#endif