/*=============================================================================

		タイトル[ title.cpp ]

-------------------------------------------------------------------------------
	■　製作者
		大野拓也

	■　作成日
		2016/12/15
-------------------------------------------------------------------------------
	■　Update
=============================================================================*/
/*-----------------------------------------------------------------------------
	ヘッダファイル
-----------------------------------------------------------------------------*/
#include "main.h"
#include "result.h"
#include "input.h"
#include "sound.h"
#include "fade.h"
#include "camera.h"
#include "MeshField.h"
#include "skydome.h"
#include "ResultBg.h"
#include "MeshWall.h"
#include "Player.h"
#include "Born.h"

/*-----------------------------------------------------------------------------
	定数定義
-----------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------
	列挙
-----------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------
	構造体
-----------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------
	プロトタイプ宣言
-----------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------
	グローバル変数
-----------------------------------------------------------------------------*/

/*-----------------------------------------------------------------------------
 関数名:	void InitResult( void )
 引数:		
 戻り値:	
 説明:		初期化
-----------------------------------------------------------------------------*/
void InitResult( void )
{

	InitCamera();	//	カメラの初期化

	InitMeshField();		//	メッシュフィールドの初期化

	InitMeshWall();		//	メッシュウォールの初期化

	InitSkydome();		//	スカイドームの初期化

	InitBorn();		//	助け人の初期化

	InitPlayer();		//	プレイヤーの初期化

	InitResultBg();		//	リザルトの初期化

	//	音楽再生
	PlaySound( SOUND_LABEL_BGM_RESULT );

}	//	end of func

/*-----------------------------------------------------------------------------
 関数名:	void UninitResult( void )
 引数:		
 戻り値:	
 説明:		終了
-----------------------------------------------------------------------------*/
void UninitResult( void )
{

	UninitMeshField();		//	メッシュフィールドの終了

	UninitMeshWall();	//	メッシュウォールの終了

	UninitSkydome();		//	スカイドームの終了

	UninitPlayer();	//	プレイヤーの終了

	UninitBorn();	//	助け人の終了

	UninitResultBg();	//	リザルトの終了

}	//	end of func

/*-----------------------------------------------------------------------------
 関数名:	void UpdateResult( void )
 引数:		
 戻り値:	
 説明:		更新
-----------------------------------------------------------------------------*/
void UpdateResult( void )
{

	UpdateMeshField();		//	メッシュフィールドの更新

	UpdateMeshWall();	//	メッシュウォールの更新

	UpdateSkydome();		//	スカイドームの更新

	UpdatePlayer();	//	プレイヤーの更新

	UpdateBorn();	//	助け人の更新

	UpdateResultBg();	//	リザルトの更新

	//	画面遷移
	if( GetKeyboardTrigger( DIK_SPACE ) )
	{

		//	フェードのセット
		SetFade( FADE_OUT , MODE_TITLE );

		//	音楽再生
		PlaySound( SOUND_LABEL_SE_ENTER );

		//	何番目の音を止める
		StopSound( SOUND_LABEL_BGM_RESULT );

	}	//	end of if

}	//	end of func

/*-----------------------------------------------------------------------------
 関数名:	void DrawResult( void )
 引数:		
 戻り値:	
 説明:		描画
-----------------------------------------------------------------------------*/
void DrawResult( void )
{

	DrawMeshField();		//	メッシュフィールドの描画

//	DrawSkydome();		//	スカイドームの描画

	DrawMeshWall();		//	メッシュウォールの描画

	DrawPlayer();		//	プレイヤーの描画

	DrawBorn();		//	助け人の描画

	DrawResultBg();		//	リザルトの描画

}	//	end of func